---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarTrimExtendData.GetNumberOfBarGeometry
source: html/58c19b83-13ae-de95-4950-aefa2873f687.htm
---
# Autodesk.Revit.DB.Structure.RebarTrimExtendData.GetNumberOfBarGeometry Method

Gets the number of Bar Geometry that were added.

## Syntax (C#)
```csharp
public int GetNumberOfBarGeometry()
```

## Returns
Returns the number of Bar Geometry that were added.